JWXL19733/WeGui_RGB/CW32L012/Lcd_Port/cw32l012_lcd_hard_3spi_port.c
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}

//---------方式4:页缓存动态刷新----------
#elif (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE)
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	//每page做"sum+mini_crc组合"校验,若校验码没变,则不刷新该page
	uint8_t ypage,y,i;
	uint16_t x,ycount;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------
		
		if(crc[ypage][0] != i_crc)
		{
			ycount = 8* ypage;
#if defined(GRAY_DRIVER_0DEG)
			//----扫描方向1(不旋转)---
			LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage*8+ycount,(SCREEN_WIDTH/2-1),(SCREEN_HIGH-1));
			LCD_DC_Set();
			LCD_CS_Clr();
			
			for(y=0;y<8;y++)
			{
				uint8_t mask;
				ycount++;
				if((ycount >= SCREEN_HIGH)||(y>=(GRAM_YPAGE_NUM*8))){break;}

				mask=0x01<<(y%8);
				for(x=0;x<SCREEN_WIDTH;)
				{
					//----第一个点----
					i = 0x00;
					if(lcd_driver.LCD_GRAM[ypage][x][0]&mask)
					{
						i = GRAY_COLOUR<<4;
					}
					//----第二个点----
					x++;
					if((lcd_driver.LCD_GRAM[ypage][x][0]&mask)&&(x<SCREEN_WIDTH))
					{
						i |= GRAY_COLOUR;
					}
					x++;
					wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
					send_lcd_spi_dat(0x100|(i>>8));//向SPI发送缓冲器发送一个数据
					wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
					send_lcd_spi_dat(0x100|(i&0x00ff));//向SPI发送缓冲器发送一个数据
				}
			}

#elif defined(GRAY_DRIVER_90DEG)
			//---扫描方向2(90度旋转)----
			LCD_Set_Addr(lcd_driver.lcd_refresh_ypage*4 + ycount/2,0,((SCREEN_HIGH+1)/2-1),(SCREEN_WIDTH-1));
			LCD_CS_Clr();
			for(y=0;y<8;)
			{
				if(++ycount >= SCREEN_HIGH){break;}
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					//(4位一个点)
					//----第一个点----
					i = 0x00;
					//j = y + lcd_driver.lcd_refresh_ypage*8;
					//if((j+1)<=SCREEN_HIGH)
					{
						if(lcd_driver.LCD_GRAM[ypage][x][0]&(0x01<<y))
						{
							i = GRAY_COLOUR<<4;
						}
						//----第二个点----
						//if((j+1)<SCREEN_HIGH)
						{
							if(lcd_driver.LCD_GRAM[ypage][x][0]&(0x01<<(y+1)))
							{
								i |= GRAY_COLOUR;
							}
						}
					}
					wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
					send_lcd_spi_dat(0x100|(i>>8));//向SPI发送缓冲器发送一个数据
					wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
					send_lcd_spi_dat(0x100|(i&0x00ff));//向SPI发送缓冲器发送一个数据
				}
				y+=2;
			}
#endif
			crc[ypage][0] = i_crc;
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_done();//等待SPI发送器空闲(发完)
			LCD_CS_Set();
		}
	}
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif
//----------------------------RGB565屏幕刷屏接口-------------------------------------
#elif defined (LCD_USE_RGB565)
#if (LCD_MODE == _FULL_BUFF_FULL_UPDATE)
//---------方式1:全缓存全屏刷----------
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	uint16_t x,y;
	LCD_Set_Addr(0,0,SCREEN_WIDTH-1,SCREEN_HIGH-1);
	
	LCD_CS_Clr();
	
	for(y=0;y<SCREEN_HIGH;y++)
	{
		uint8_t ypage=y/8;
		uint8_t mask=0x01<<(y%8);
		uint8_t *gram=&lcd_driver.LCD_GRAM[ypage][0][0];
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			uint16_t c=0;
			#if (LCD_COLOUR_BIT>=1)//---1位色---
				if(*gram++&mask){c+=1;}
			#endif
			#if (LCD_COLOUR_BIT>=2)//---2位色---
				if(*gram++&mask){c+=2;}
			#endif
			#if (LCD_COLOUR_BIT>=3)//---3位色---
				if(*gram++&mask){c+=4;}
			#endif
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(0x100|(lcd_driver.colour[c]>>8));//向SPI发送缓冲器发送一个数据
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(0x100|(lcd_driver.colour[c]&0x00ff));//向SPI发送缓冲器发送一个数据
		}
	}
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空 (某些芯片可以省略掉这一句)
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
	return 0;
}

#elif (LCD_MODE == _FULL_BUFF_DYNA_UPDATE)
//---------方式2:全缓存动态刷----------
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	//每page做校验,若校验码没变,则不刷新该page
	uint8_t ypage;
	uint16_t x,ycount;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint16_t i_crc;
		uint8_t i_dyna_count;//每页检测DYNA_CRC_NUM次
		for(i_dyna_count=0;i_dyna_count<PAGE_CRC_NUM;i_dyna_count++)
		{
			uint16_t x_start = i_dyna_count * DYNA_CRC_ONCE_XNUM;
			uint16_t x_end   = x_start + DYNA_CRC_ONCE_XNUM ;
			uint8_t *i = &lcd_driver.LCD_GRAM[ypage][x_start][0];
			if(x_end > (SCREEN_WIDTH-1)){x_end = SCREEN_WIDTH-1;}
			//--------CRC算法校验--------
			//--方式1.库函数--
			//i_crc = CRC16_Calc_8bit(CRC16_IBM, i, (x_end-x_start)*LCD_COLOUR_BIT);//从*i开始校验, 连续校验(x_end-x_start)*LCD_COLOUR_BIT次
			//--方式2.寄存器--
			CW_CRC->CR = CRC16_IBM;//清空CRC计算值
			for(x=0;x<=(x_end-x_start)*LCD_COLOUR_BIT;x++) //从*i开始校验, 连续校验(x_end-x_start)*LCD_COLOUR_BIT次
			{
				CW_CRC->DR = *i++;
			}
			i_crc = CW_CRC->RESULT;//把校验值, 赋给i_crc
			//---------------------------
		
			if(crc[ypage][i_dyna_count] != i_crc)
			{
				uint8_t y=0;
				LCD_Set_Addr(x_start,(ypage)*8,x_end,SCREEN_HIGH-1);
				LCD_CS_Clr();
				
				ycount = 8* (ypage);
				for(y=0;y<8;y++)
				{
					uint8_t mask;
					if(++ycount > SCREEN_HIGH)
					{
						break;
					}
					mask=0x01<<(y%8);
					uint8_t *gram=&lcd_driver.LCD_GRAM[ypage][x_start][0];
					for(x=0;x<=(x_end-x_start);x++)
					{
						uint8_t c=0;
						#if (LCD_COLOUR_BIT>=1)//---1位色---
							if(*gram++&mask){c+=1;}
						#endif
						#if (LCD_COLOUR_BIT>=2)//---2位色---
							if(*gram++&mask){c+=2;}
						#endif
						#if (LCD_COLOUR_BIT>=3)//---3位色---
							if(*gram++&mask){c+=4;}
						#endif
						wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
						send_lcd_spi_dat(0x100|(lcd_driver.colour[c]>>8));//向SPI发送缓冲器发送一个数据
						wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
						send_lcd_spi_dat(0x100|(lcd_driver.colour[c]&0x00ff));//向SPI发送缓冲器发送一个数据
					}
				}
				crc[ypage][i_dyna_count] = i_crc;
				wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空 (某些芯片可以省略掉这一句)
				send_lcd_spi_done();//等待SPI发送器空闲(发完)
				LCD_CS_Set();
			}
		}
	}
	LCD_CS_Set();
	return 0;
}
#elif (LCD_MODE == _PAGE_BUFF_FULL_UPDATE)
//---------方式3:页缓存全屏刷新----------
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	uint16_t x,y;
	LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
	LCD_CS_Clr();
	for(y=0;(y+lcd_driver.lcd_refresh_ypage*8)<SCREEN_HIGH;)
	{
		uint8_t mask=0x01<<(y%8);
		uint8_t *gram=&lcd_driver.LCD_GRAM[y/8][0][0];
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			uint8_t c=0;
			#if (LCD_COLOUR_BIT>=1)//---1位色---
				if(*gram++&mask){c+=1;}
			#endif
			#if (LCD_COLOUR_BIT>=2)//---2位色---
				if(*gram++&mask){c+=2;}
			#endif
			#if (LCD_COLOUR_BIT>=3)//---3位色---
				if(*gram++&mask){c+=4;}
			#endif
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(0x100|(lcd_driver.colour[c]>>8));//向SPI发送缓冲器发送一个数据
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(0x100|(lcd_driver.colour[c]&0x00ff));//向SPI发送缓冲器发送一个数据
		}
		y++;
		if(y>=(GRAM_YPAGE_NUM*8))
		{
			break;
		}
	}
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空 (某些芯片可以省略掉这一句)
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
	
